{
  "model_type": "bernini_renderer",
  "architectures": ["BerniniRendererModel"],
  "wan22_base": "ByteDance/Bernini-R-1.3B-Diffusers",
  "skip_transformer_1": false,
  "skip_transformer_2": true,
  "switch_dit_boundary": 0,
  "max_sequence_length": 512,
  "shift": 3.0,
  "use_unipc": true,
  "use_src_id_rotary_emb": true
}
